PrestoDL/Project_S32K_Vehicle/code/DEMO2-20241216.c
/*
button 3/2 : accel/brake - DC motor, 7Seg, LED(brake, 00111100)
button 5/4 toggle : L/R turn blinker - LED blinking toggle(11000000, 00000011)
button 1 toggle : Gear : Forward or Backward
시계방향 : 전진 / 반시계바향 : 후진

VR : handle - step motor : 제대로 동작하지 않을 시, 메인보드 위 가변저항으로 대체.

uWave : AEB - DC motor, 7seg, LED blinking(11111111), buzzer
 */



#include "S32K144.h"
// #include "Startup_S32K144.s"

#define PCC_BASE	(0x40065000)
#define PCC_LPIT	*((volatile unsigned*)(PCC_BASE + 0xDC))
#define PCC_FTM0	*((volatile unsigned*)(PCC_BASE + 0xE0))
#define PCC_FTM2    *((volatile unsigned*)(PCC_BASE + 0xE8)) //////////////////// 20241211 한구 추가
#define PCC_ADC0	*((volatile unsigned*)(PCC_BASE + 0xEC))

#define PCC_PORTA   *((volatile unsigned*)(PCC_BASE + 0x124))
#define PCC_PORTB   *((volatile unsigned*)(PCC_BASE + 0x128))
#define PCC_PORTC   *((volatile unsigned*)(PCC_BASE + 0x12C))
#define PCC_PORTD   *((volatile unsigned*)(PCC_BASE + 0x130))
#define PCC_PORTE   *((volatile unsigned*)(PCC_BASE + 0x134))

#define PCS_BITS	24
#define CGC_BIT		30


#define LPIT_BASE	(0x40037000)
#define LPIT_MCR	*((volatile unsigned*)(LPIT_BASE + 0x8))
#define LPIT_MSR	*((volatile unsigned*)(LPIT_BASE + 0xC))
#define LPIT_MIER	*((volatile unsigned*)(LPIT_BASE + 0x10))
#define LPIT_TVAL0	*((volatile unsigned*)(LPIT_BASE + 0x20))
#define LPIT_TCTRL0	*((volatile unsigned*)(LPIT_BASE + 0x28))

#define M_CEN_BIT	0
#define TIF0_BIT	0
#define TIE0_BIT	0
#define MODE_BITS	2
#define T_EN_BIT	0




#define NVIC_ISER_BASE	(0xE000E100)
#define NVIC_ISER1		*((volatile unsigned*)(NVIC_ISER_BASE + 0x4))

#define NVIC_ICPR_BASE	(0xE000E280)
#define NVIC_ICPR1		*((volatile unsigned*)(NVIC_ICPR_BASE + 0x4))

#define NVIC_IPR_BASE	(0xE000E400)
#define NVIC_IPR48		*((volatile unsigned char*)(NVIC_IPR_BASE + 0x30))
#define NVIC_IPR59		*((volatile unsigned char*)(NVIC_IPR_BASE + 0x3B)) /////////////// 추가 한구
#define NVIC_IPR61		*((volatile unsigned char*)(NVIC_IPR_BASE + 0x3D))



#define FTM0_BASE	(0x40038000)
#define FTM0_SC		*((volatile unsigned*)(FTM0_BASE + 0x0))
#define FTM0_MOD	*((volatile unsigned*)(FTM0_BASE + 0x8))		//////////////////////// 추가 한구
#define FTM0_C1SC	*((volatile unsigned*)(FTM0_BASE + 0x14))
#define FTM0_C1V	*((volatile unsigned*)(FTM0_BASE + 0x18))
#define FTM0_CNTIN  *((volatile unsigned*)(FTM0_BASE + 0x4C))

#define FTM2_BASE	(0x4003A000)								//////////////////////20241210
#define FTM2_SC     *((volatile unsigned*)(FTM2_BASE + 0x0))
#define FTM2_MOD  	*((volatile unsigned*)(FTM2_BASE + 0x8))
#define FTM2_C2SC  	*((volatile unsigned*)(FTM2_BASE + 0x1C))
#define FTM2_C2V   	*((volatile unsigned*)(FTM2_BASE + 0x20))
#define FTM2_C5SC  	*((volatile unsigned*)(FTM2_BASE + 0x34))		//////////////////////// 추가 한구
#define FTM2_C5V   	*((volatile unsigned*)(FTM2_BASE + 0x38))		//////////////////////// 추가 한구
#define FTM2_CNTIN 	*((volatile unsigned*)(FTM0_BASE + 0x4C))

#define PWMEN0_BIT	16/////////////////////////////////////////////////////// 추가 한구
#define PWMEN1_BIT	17
#define PWMEN2_BIT	18
#define PWMEN5_BIT  21 ///////////////////////////////////////////////// 20241210
#define CLKS_BITS	3
#define PS_BITS		0
#define MSB_BIT     5
#define MSA_BIT     4
#define ELSB_BIT	3
#define ELSA_BIT	2


#define ADC0_BASE   (0x4003B000)
#define ADC0_SC1A   *((volatile unsigned*)(ADC0_BASE + 0x0))
#define ADC0_CFG1   *((volatile unsigned*)(ADC0_BASE + 0x40))
#define ADC0_CFG2   *((volatile unsigned*)(ADC0_BASE + 0x44))
#define ADC0_RA     *((volatile unsigned*)(ADC0_BASE + 0x48))
#define ADC0_SC2	*((volatile unsigned*)(ADC0_BASE + 0x90))
#define ADC0_SC3	*((volatile unsigned*)(ADC0_BASE + 0x94))

#define ADCH_BITS	0
#define COCO_BIT	7
#define MODE_BITS  	2
#define ADIV_BITS   5
#define SMPLTS_BITS 0
#define ADTRG_BIT   6
#define ADC0_SE7    7   // PTB3 : VR&CDS 제대로 동작하지 않을 경우, 주석처리
#define ADC0_SE12   12	// PTB3 VR&CDS 제대로 동작하지 않을 경우, 메인보드 위 가변 저항으로 동작 수정.



#define PORTA_BASE	(0x40049000)
#define PORTA_PCR1	*((volatile unsigned*)(PORTA_BASE + 0x4)) // button_1 : Gear(Forward / Backward) ///////////////// 한구 사용.
#define PORTA_PCR2	*((volatile unsigned*)(PORTA_BASE + 0x8)) // button_2 : accel
#define PORTA_PCR3  *((volatile unsigned*)(PORTA_BASE + 0xC)) // button_3 : brake
#define PORTA_PCR11 *((volatile unsigned*)(PORTA_BASE + 0x2C)) // button_4 : blinkerR
#define PORTA_PCR12 *((volatile unsigned*)(PORTA_BASE + 0x30)) // button_5 : blinkerL
#define PORTA_PCR6  *((volatile unsigned*)(PORTC_BASE + 0x18)) // uWave : trig
#define PORTA_PCR7  *((volatile unsigned*)(PORTC_BASE + 0x1C)) // uWave : echo

#define PORTB_BASE	(0x4004A000)
#define PORTB_PCR0	*((volatile unsigned*)(PORTB_BASE + 0x0)) // Seg_COM3 : velocity 00x
#define PORTB_PCR1	*((volatile unsigned*)(PORTB_BASE + 0x4)) // Seg_COM4 : velocity 0x0
#define PORTB_PCR2	*((volatile unsigned*)(PORTB_BASE + 0x8)) // Seg_COM5 : velocity x00
#define PORTB_PCR3	*((volatile unsigned*)(PORTB_BASE + 0xC)) // VR&CDS, if 제대로 동작 않을 시, 사용X 하고 메인보드 가변저항으로 대체
#define PORTB_PCR4	*((volatile unsigned*)(PORTB_BASE + 0x10))
#define PORTB_PCR17	*((volatile unsigned*)(PORTB_BASE + 0x44)) // Buzzer

#define PORTB_PCR12	*((volatile unsigned*)(PORTB_BASE + 0x30))

#define PORTC_BASE  (0x4004B000)
//#define PORTC_PCR0  *((volatile unsigned*)(PORTC_BASE + 0x0)) // DC motor // 사용 안 할 예정
//#define PORTC_PCR1  *((volatile unsigned*)(PORTC_BASE + 0x4)) // Servo motor // 사용 안 할 예정
//#define PORTC_PCR2  *((volatile unsigned*)(PORTC_BASE + 0x8)) // Step motor // 사용 안 할 예정
#define PORTC_PCR3  *((volatile unsigned*)(PORTC_BASE + 0xC)) // Buzzer
#define PORTC_PCR13 *((volatile unsigned*)(PORTC_BASE + 0x34))

#define PORTD_BASE  (0x4004C000)
#define PORTD_PCR0  *((volatile unsigned*)(PORTD_BASE + 0x0))  // Seg_A
#define PORTD_PCR7  *((volatile unsigned*)(PORTD_BASE + 0x1C)) // Seg_B
#define PORTD_PCR2  *((volatile unsigned*)(PORTD_BASE + 0x8))  // Seg_C
#define PORTD_PCR3  *((volatile unsigned*)(PORTD_BASE + 0xC))  // Seg_D
#define PORTD_PCR4  *((volatile unsigned*)(PORTD_BASE + 0x10)) // Seg_E
#define PORTD_PCR5  *((volatile unsigned*)(PORTD_BASE + 0x14)) // Seg_F
#define PORTD_PCR6  *((volatile unsigned*)(PORTD_BASE + 0x18)) // Seg_G
#define PORTD_PCR12 *((volatile unsigned*)(PORTD_BASE + 0x30)) // DC Motor Forward PWM
#define PORTD_PCR14 *((volatile unsigned*)(PORTD_BASE + 0x38)) // DC Motor Backward PWM
#define PORTD_PCR16 *((volatile unsigned*)(PORTD_BASE + 0x40)) // Servo Motor


#define PORTE_BASE	(0x4004D000)
#define PORTE_PCR0	*((volatile unsigned*)(PORTE_BASE + 0x0))   // LED_1 : most right one
#define PORTE_PCR1  *((volatile unsigned*)(PORTE_BASE + 0x4))   // LED_2
#define PORTE_PCR2  *((volatile unsigned*)(PORTE_BASE + 0x8))   // LED_3
#define PORTE_PCR3  *((volatile unsigned*)(PORTE_BASE + 0xC))   // LED_4
#define PORTE_PCR8  *((volatile unsigned*)(PORTE_BASE + 0x20))  // LED_5
#define PORTE_PCR5  *((volatile unsigned*)(PORTE_BASE + 0x14))  // LED_6
#define PORTE_PCR6  *((volatile unsigned*)(PORTE_BASE + 0x18))  // LED_7
#define PORTE_PCR7  *((volatile unsigned*)(PORTE_BASE + 0x1C))  // LED_8 : most left one

#define MUX_BITS	8
#define IRQC_BITS	16 //Interrupt Type  /////////////////// 추가 한구
#define ISF_BIT		24 //Interrupt set flag //////////////// 추가 한구


#define GPIOA_BASE	(0x400FF000)
#define GPIOA_PDIR	*((volatile unsigned*)(GPIOA_BASE + 0x10))
#define GPIOA_PDDR  *((volatile unsigned*)(GPIOA_BASE + 0x14))

#define GPIOB_BASE  (0x400FF040)
#define GPIOB_PSOR  *((volatile unsigned*)(GPIOB_BASE + 0x4))
#define GPIOB_PCOR  *((volatile unsigned*)(GPIOB_BASE + 0x8))
#define GPIOB_PDDR  *((volatile unsigned*)(GPIOB_BASE + 0x14))

#define GPIOC_BASE  (0x400FF080)
#define GPIOC_PSOR  *((volatile unsigned*)(GPIOC_BASE + 0x4))
#define GPIOC_PCOR  *((volatile unsigned*)(GPIOC_BASE + 0x8))
#define GPIOC_PDDR  *((volatile unsigned*)(GPIOC_BASE + 0x14))

#define GPIOD_BASE  (0x400FF0C0)
#define GPIOD_PSOR  *((volatile unsigned*)(GPIOD_BASE + 0x4))
#define GPIOD_PCOR  *((volatile unsigned*)(GPIOD_BASE + 0x8))
#define GPIOD_PDDR  *((volatile unsigned*)(GPIOD_BASE + 0x14))

#define GPIOE_BASE  (0x400FF100)
#define GPIOE_PSOR  *((volatile unsigned*)(GPIOE_BASE + 0x4))
#define GPIOE_PCOR  *((volatile unsigned*)(GPIOE_BASE + 0x8))
#define GPIOE_PDDR  *((volatile unsigned*)(GPIOE_BASE + 0x14))

