PrestoDL/Project_S32K_Vehicle/code/DEMO2-20241216.c
void set7segmentNum8() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD4) | (1 << PTD5) | (1 << PTD6);
}

void set7segmentNum9() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD5) | (1 << PTD6);
   GPIOD_PCOR |= (1 << PTD4);
}

void set7segmentP(){
	GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD4) | (1 << PTD5) | (1 << PTD6);
	GPIOD_PCOR |= (1 << PTD2) | (1 << PTD3);
}

void set7segmentR(){
	GPIOD_PSOR |= (1 << PTD4) | (1 << PTD6);
	GPIOD_PCOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD5);
}

void set7segmentN(){
	GPIOD_PSOR |= (1 << PTD2) | (1 << PTD4) | (1 << PTD6);
	GPIOD_PCOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD3) | (1 << PTD5);
}

void set7segmentD(){
	GPIOD_PSOR |= (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD4) | (1 << PTD6);
	GPIOD_PCOR |= (1 << PTD0) | (1 << PTD5);
}

void set7segmentNum(int num) {
   switch(num) {
   case 0:
      set7segmentNum0();
      break;
   case 1:
      set7segmentNum1();
      break;
   case 2:
      set7segmentNum2();
      break;
   case 3:
      set7segmentNum3();
      break;
   case 4:
      set7segmentNum4();
      break;
   case 5:
      set7segmentNum5();
      break;
   case 6:
      set7segmentNum6();
      break;
   case 7:
      set7segmentNum7();
      break;
   case 8:
      set7segmentNum8();
      break;
   case 9:
      set7segmentNum9();
      break;
   default:
      set7segmentNumClear();
   }
}

void set7segmentGear(int GEAR){
	switch(GEAR){
	case 0:
		set7segmentP();
		break;
	case 1:
		set7segmentN();
		break;
	case 2:
		set7segmentR();
		break;
	case 3:
		set7segmentD();
		break;
	default:
		set7segmentNumClear();
		break;
	}
}

void displayDigitClear() {
   set7segmentNumClear();

   GPIOB_PCOR |= (1 << PTB0) | (1 << PTB1) | (1 << PTB2) | (1 << PTB12);
}

void displayDigit1(int num) {
   GPIOB_PSOR |= (1 << PTB0);
   set7segmentNum(num);
}

void displayDigit2(int num) {
   GPIOB_PSOR |= (1 << PTB1);
   set7segmentNum(num);
}

void displayDigit3(int num) {
   GPIOB_PSOR |= (1 << PTB2);
   set7segmentNum(num);
}

void displayDigit4(int GEAR){
	GPIOB_PSOR |= (1 << PTB12);
	set7segmentGear(GEAR);

}

void displayDigits(int num, int GEAR) {
   int n1, n2, n3;

   n3 = (num % 1000) / 100;
   n2 = (num % 100) / 10;
   n1 = num % 10;

   displayDigitClear();
   displayDigit4(GEAR);
   for(int i = 0; i < 1000; i++) {
      int b = 1 + 2;
   }
   displayDigitClear();
   displayDigit3(n3);
   for(int i = 0; i < 1000; i++) {
      int b = 1 + 2;
   }
   displayDigitClear();
   displayDigit2(n2);
   for(int i = 0; i < 1000; i++) {
      int b = 1 + 2;
   }
   displayDigitClear();
   displayDigit1(n1);
   for(int i = 0; i < 1000; i++) {
      int b = 1 + 2;
   }
}

void LPIT0_init(void) {
   PCC_LPIT &= ~((0b111) << PCS_BITS);
   PCC_LPIT |= ((0b110) << PCS_BITS);
   PCC_LPIT |= (1 << CGC_BIT);

   LPIT_MCR |= (1 << M_CEN_BIT);

   LPIT_MIER |= (1 << TIE0_BIT);

   LPIT_TVAL0 = 400; // 0.00001s (e-5)

   LPIT_TCTRL0 &= ~((0b11) << MODE_BITS);
   LPIT_TCTRL0 |= (1 << T_EN_BIT);
}

void LPIT0_disable(void) {
   LPIT_MCR &= ~(1 << M_CEN_BIT);
}

void LPIT0_enable(void) {
   LPIT_MCR |= (1 << M_CEN_BIT);
}

void NVIC_init_IRQs(void) {
   NVIC_ICPR1 |= (1 << (48 % 32)) | (1 << (59%32));  ////////// 추가 한구
   NVIC_ISER1 |= (1 << (48 % 32)) | (1 << (59%32));  ///////// 추가 한구
   NVIC_ICPR1 |= (1 << (61 % 32));
   NVIC_ISER1 |= (1 << (61 % 32));
   NVIC_IPR48 = (10<<4);
   NVIC_IPR59 = (8<<4);////////////////////////////// 추가 한구 : Interrupt PortA
   NVIC_IPR61 = (8<<4);

}

void LPIT0_Ch0_IRQHandler(void) {
   time += 1;
   LPIT_MSR |= (1 << TIF0_BIT);
}

void PORTA_IRQHandler(void) // PORTA interrupt handler
{
	if((GEARSET == P || GEARSET == R)&&velocity == 0)
	{
		FTM2_C2V = 0;
		FTM2_C5V = 0;
		GEARSET = D;
		SelectPiezoGear = 1;
		SelectGearForwardBackward = 1;
	}
	else if(GEARSET == D && velocity == 0)
	{
		FTM2_C5V = 0;
		FTM2_C5V = 0;
		GEARSET = R;
		SelectPiezoGear = 1;
		SelectGearForwardBackward = 0;// // 0, 1 : Backward, Forward
	}
	PORTA_PCR1 |= (1<<ISF_BIT);
}

void PORTC_IRQHandler(void)
{
	if(velocity == 0){
		GEARSET = P;
		SelectPiezoGear = 1;
	}
	PORTC_PCR13 |= (1<<ISF_BIT);
}



void FTM0_CH1_PWM(void) {
   PCC_FTM0 &= ~(1 << CGC_BIT);
   PCC_FTM0 &= ~((0b111) << PCS_BITS);
   PCC_FTM0 |= ((0b010) << PCS_BITS);
   PCC_FTM0 |= (1 << CGC_BIT);

   FTM0_SC |= (1 << PWMEN1_BIT);
   FTM0_SC &= ~((0b111) << PS_BITS);
   FTM0_SC |= ((0b001) << PS_BITS);

   FTM0_MOD = 80000;
   FTM0_CNTIN = 0;

   FTM0_C1SC |= (1 << MSB_BIT);
   FTM0_C1SC |= (1 << ELSA_BIT);

   FTM0_C1V = 0;

   FTM0_SC |= ((0b11) << CLKS_BITS);
}

void FTM2_CH2_PWM(void) {
   PCC_FTM2 &= ~(1 << CGC_BIT);
   PCC_FTM2 &= ~((0b111) << PCS_BITS);
   PCC_FTM2 |= ((0b010) << PCS_BITS);
   PCC_FTM2 |= (1 << CGC_BIT);

   FTM2_SC |= (1 << PWMEN2_BIT);
   FTM2_SC &= ~((0b111) << PS_BITS);
   FTM2_SC |= ((0b001) << PS_BITS);

   FTM2_MOD = 16000-1;
   FTM2_CNTIN = 0;

   FTM2_C2SC |= (1 << MSB_BIT);
   FTM2_C2SC |= (1 << ELSA_BIT);

   FTM2_C2V = 0;

   FTM2_SC |= ((0b11) << CLKS_BITS);
}


void FTM2_CH5_PWM(void) {
   PCC_FTM2 &= ~(1 << CGC_BIT);
   PCC_FTM2 &= ~((0b111) << PCS_BITS);
   PCC_FTM2 |= ((0b010) << PCS_BITS);
   PCC_FTM2 |= (1 << CGC_BIT);

   FTM2_SC |= (1 << PWMEN5_BIT);
   FTM2_SC &= ~((0b111) << PS_BITS);
   FTM2_SC |= ((0b001) << PS_BITS);

   FTM2_MOD = 16000-1;
   FTM2_CNTIN = 0;

   FTM2_C5SC |= (1 << MSB_BIT);
   FTM2_C5SC |= (1 << ELSA_BIT);

   FTM2_C5V = 0;

   FTM2_SC |= ((0b11) << CLKS_BITS);
}

void ADC0_init(void) {
   PCC_ADC0 &= ~(1 << CGC_BIT);
   PCC_ADC0 &= ~((0b111) << PCS_BITS);
   PCC_ADC0 |= ((0b001) << PCS_BITS);
   PCC_ADC0 |= (1 << CGC_BIT);

   ADC0_SC1A |= ((0b111111) << ADCH_BITS);

   ADC0_CFG1 &= ~((0b11) << ADIV_BITS);
   ADC0_CFG1 &= ~((0b11) << MODE_BITS);
   ADC0_CFG1 |= ((0b01) << MODE_BITS);

