PrestoDL/Project_S32K_Vehicle/code/DEMO2-20241216.c
   ADC0_CFG2 &= ~(255 << SMPLTS_BITS);
   ADC0_CFG2 |= (12 << SMPLTS_BITS);

   ADC0_SC2 &= ~(1 << ADTRG_BIT);
}

void adc_start(void) {
   ADC0_SC1A &= ~((0b111111) << ADCH_BITS);
   ADC0_SC1A |= (ADC0_SE7 << ADCH_BITS);
   // ADC0_SC1A |= (ADC0_SE12 << ADCH_BITS); // VR&CDS 제대로 동작하지 않을 시, 메인보드 위 가변 저항으로 대체.
}


uint32_t read_adc_chx(void) {
   while((ADC0_SC1A & (1 << COCO_BIT)) == 0) {}
   return ADC0_RA;
}

void SOSC_init_8MHz(void) {
   SCG->SOSCDIV = SCG_SOSCDIV_SOSCDIV1(1)|SCG_SOSCDIV_SOSCDIV2(1);
   SCG->SOSCCFG = SCG_SOSCCFG_RANGE(2)|SCG_SOSCCFG_EREFS_MASK;

   while(SCG->SOSCCSR & SCG_SOSCCSR_LK_MASK);
   SCG->SOSCCSR = SCG_SOSCCSR_SOSCEN_MASK;

   while(!(SCG->SOSCCSR & SCG_SOSCCSR_SOSCVLD_MASK));
}

void SPLL_init_160MHz(void) {
   while(SCG->SPLLCSR & SCG_SPLLCSR_LK_MASK);
   SCG->SPLLCSR &= ~SCG_SPLLCSR_SPLLEN_MASK;

   SCG->SPLLDIV |= SCG_SPLLDIV_SPLLDIV1(2) | SCG_SPLLDIV_SPLLDIV2(3);

   SCG->SPLLCFG = SCG_SPLLCFG_MULT(24);

   while(SCG->SPLLCSR & SCG_SPLLCSR_LK_MASK);
   SCG->SPLLCSR |= SCG_SPLLCSR_SPLLEN_MASK;

   while(!(SCG->SPLLCSR & SCG_SPLLCSR_SPLLVLD_MASK));
}

void NormalRUNmode_80MHz(void) {
   SCG->SIRCDIV = SCG_SIRCDIV_SIRCDIV1(1) | SCG_SIRCDIV_SIRCDIV2(1);

   SCG->RCCR = SCG_RCCR_SCS(6) | SCG_RCCR_DIVCORE(0b01) | SCG_RCCR_DIVBUS(0b01) | SCG_RCCR_DIVSLOW(0b10);

   while (((SCG->CSR & SCG_CSR_SCS_MASK) >> SCG_CSR_SCS_SHIFT) != 6) {}
}



void setHandle(int handleAngle) {
    if(handleAngle > 3072)
    {
    	if(velocity > 80){
    		SelectPiezoGear = 1;
    		FTM0_C1V = 9600-1200;
    		return;
    	}
    	FTM0_C1V = 13200-1200; // VR&CDS용
    	//FTM2_C5V = 6000-1200; // 메인보드 가변저항용
    }
    else if(handleAngle > 1024)
    {
  	  FTM0_C1V = 9600-1200;
    }
    else if(handleAngle > -1)
    {
    	if(velocity > 80){
    		SelectPiezoGear = 1;
    		FTM0_C1V = 9600-1200;
    		return;
    	}
    	FTM0_C1V = 6000-1200;
    	//FTM2_C5V = 13200-1200;
    }
    else
    {
  	  FTM0_C1V = 9600-1200;
    }
}

void setBlinkLED(int blinkerSwitch) {
   if (blinkerSwitch == 1) {
      GPIOE_PSOR |= (1 << PTE0) | (1 << PTE1) | (1 << PTE6) | (1 << PTE7);
   }

   else if ((time - blinkerTime) % 50000 < 25000) { // turn on
      if (blinkerSwitch == 0) {
         GPIOE_PSOR |= (1 << PTE0) | (1 << PTE1);
         GPIOE_PCOR |= (1 << PTE6) | (1 << PTE7);
      }

      else {
         GPIOE_PSOR |= (1 << PTE6) | (1 << PTE7);
         GPIOE_PCOR |= (1 << PTE0) | (1 << PTE1);
      }
   }

   else {
      GPIOE_PSOR |= (1 << PTE0) | (1 << PTE1) | (1 << PTE6) | (1 << PTE7);
   }
}

void setBrakeLED() {
   if (brakeLED == 0) { // brake initiate
      GPIOE_PSOR |= (1 << PTE2) | (1 << PTE3) | (1 << PTE8) | (1 << PTE5);
   }

   else { // no brake
      GPIOE_PCOR |= (1 << PTE2) | (1 << PTE3) | (1 << PTE8) | (1 << PTE5);
   }
}




void setDCmotorGear(int velocity) {
	if(SelectGearForwardBackward == 1) {// 전진
		FTM2_C5V = 0;
		FTM2_C2V = (velocity*1200000)/4095; ////////////////// 숫자값 추후 확인
		//GEARSET = D;

	}
	else if (SelectGearForwardBackward == 0) {
		FTM2_C2V = 0;
		FTM2_C5V = (velocity*1200000)/4095; ////////////////// 숫자값 추후 확인
		//GEARSET = R;
	}
	else
	{}
}

void setPiezoGear() {
	if(SelectPiezoGear==1){
		int tmp = 1800000;
		GPIOB_PSOR |= (1<<PTB17);
		while(tmp--)
		{
			if(tmp==0) {
				break;
			}
		}
		GPIOB_PCOR |= (1<<PTB17);
		SelectPiezoGear = 0;
	}
}




int main(void) {
   int toggleBlinker = 0;

   PORT_init();
   SOSC_init_8MHz();
   SPLL_init_160MHz();
   NormalRUNmode_80MHz();

   NVIC_init_IRQs();
   LPIT0_init();
   ADC0_init();


   FTM0_CH1_PWM();
   FTM2_CH2_PWM();
   FTM2_CH5_PWM();

   for(;;) { // step delay 0.00001

      // checking handleAngle
      adc_start();
      handleAngle = read_adc_chx(); // 0 ~ 2047 ~ 4095

      setHandle(handleAngle);						// 한구 작업
      setDCmotorGear((int)velocity);				// 한구 작업
      setPiezoGear();


      // checking blinker L/R
      if ((GPIOA_PDIR & (1 << PTA12)) == 0) {
         if (toggleBlinker == 0) {
            if (blinkerSwitch != 0) {
               blinkerSwitch = 0; // left Sig
               blinkerTime = time;
            }

            else {
               blinkerSwitch = 1; // turn off
            }

            toggleBlinker = 1;
         }
      }

      else if ((GPIOA_PDIR & (1 << PTA11)) == 0) {
         if (toggleBlinker == 0) {
            if (blinkerSwitch != 2) {
               blinkerSwitch = 2; // right Sig
               blinkerTime = time;
            }

            else {
               blinkerSwitch = 1; // turn off
            }

            toggleBlinker = 1;
         }
      }

      else {
         toggleBlinker = 0; // turn off
      }

      setBlinkLED(blinkerSwitch);



      
      if (lastStepTime < time) { // checking 0.00001s stepTime
         // setting uWave sensor
         if ((time % 1000) == 0) {
            GPIOA_PSOR |= (1 << PTA6);
         }

         else if ((time % 1000) == 10) {
            GPIOA_PCOR |= (1 << PTA6);
         }

         if ((GPIOA_PDIR & (1 << PTA7)) == 1) { // detected
            uWaveEcho = time % 1000; // echo time, 0.00000 ~ 0.00999
            uWaveDistance = uWaveEcho * 1.7 // as 340m/s, velo : 0.17cm / 1step
            if (uWaveDistance < UWAVELIMIT) { // distance less then limit
               uWaveDetect = 1; // reset in 0.001step
            }
         }



         // set next velocity (accel, brake, uWave?)
         // weight : uWave > brake > accel > idle
         if ((time % 1000) == 0) { // checking 0.01s stepTime
            if (uWaveDetect == 1) { // uWave detect
               brakeLED = 1;
               SelectPiezoGear = 1;
               velocity -= 2; // -200 per sec
               uWaveDetect = 0;
            }

            else if ((GPIOA_PDIR & (1 << PTA3)) == 0) { // brake
               brakeLED = 1;
               velocity -= 1; // -100 per sec
            }

            else if ((GPIOA_PDIR & (1 << PTA2)) == 0) { // accel
        	      if(GEARSET>1)
           	   {
                  brakeLED = 0;
                  velocity += ((MAXSPD - velocity) * 0.0025); // logScale acceleration
        	      }
        	      else
        	      {
        		      //
        	      }
            }

            else { // idle
               brakeLED = 0;
               velocity -= velocity * 0.0001; // -1% per sec
            }



            if (velocity < 0) { // clamping velocity (0 ~ MAXSPD)
               velocity = 0;
            }

            else if (velocity > MAXSPD) { // clamping velocity (0 ~ MAXSPD)
               velocity = MAXSPD;
            }
         }

         lastStepTime = time; // check time change
      }

      setBrakeLED();


      // show 7Seg velocity
      displayDigits((int)velocity, GEARSET);
   }

}
